src/InformationRegisters/ХранилищеАрхивов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ХранилищеАрхивов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПутьКАрхиву</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АрхивЗагруженВХранилище</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДвоичныеДанныеФайлаАрхива</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипАрхива</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыФайловАрхива</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ХранилищеАрхивов/Ext/ManagerModule.bsl
&НаСервере
//
//
Функция СохранитьДвоичныеДанныеФайлаВыгрузкиВКаталог(ИнформационнаяБаза, ДатаСобытия, ТипАрхива, КаталогСохранения) Экспорт
	Результат = Ложь;	
	ДанныеЗаписи = ПолучитьПолныеДанныеЗаписи(ДатаСобытия, ИнформационнаяБаза, ТипАрхива);
	Если ДанныеЗаписи <> Неопределено Тогда
		Если ДанныеЗаписи.Количество() > 0 Тогда 
			ДвоичныеДанныеФайлаАрхива = ДанныеЗаписи.ДвоичныеДанныеФайлаАрхива.Получить();			
			Попытка
				ДвоичныеДанныеФайлаАрхива.Записать(КаталогСохранения + ?(Прав(КаталогСохранения,3) = ".dt", "", ".dt"));
				Результат = Истина;
			Исключение
				ЗаписьЖурналаРегистрации("СохранениеФайлаВыгрузки", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка: " + ОписаниеОшибки());				
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаСервере
//
//
Функция ЗагрузитьДвоичныеДанныеАрхиваИзФайла(ИнформационнаяБаза, ДатаСобытия, ТипАрхива, КаталогЗагрузки, флПерезаписыватьПутьКФайлуАрхива= Ложь) Экспорт
	Результат = Ложь;	
	ДанныеЗаписи = РегистрыСведений.ХранилищеАрхивов.СоздатьМенеджерЗаписи();
	ДанныеЗаписи.ДатаСобытия = ДатаСобытия;
	ДанныеЗаписи.ИнформационнаяБаза = ИнформационнаяБаза.Ссылка;
	ДанныеЗаписи.Прочитать();
	Попытка
		Если ДанныеЗаписи.Выбран() Тогда		
			ДанныеЗаписи.ДвоичныеДанныеФайлаАрхива = Новый ХранилищеЗначения(Новый ДвоичныеДанные(КаталогЗагрузки), Новый СжатиеДанных(9));
			ДанныеЗаписи.АрхивЗагруженВХранилище = Истина;
			Если флПерезаписыватьПутьКФайлуАрхива Тогда ДанныеЗаписи.ПутьКАрхиву = КаталогЗагрузки; КонецЕсли;			
			ДанныеЗаписи.Записать(Истина);
			Результат = Истина;
		КонецЕсли;		
	Исключение
		ЗаписьЖурналаРегистрации("ЗагрузкаФайлаВыгрузки", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка: " + ОписаниеОшибки());				
	КонецПопытки;
	Возврат Результат;
КонецФункции

&НаСервере
//
//
Функция УдалитьДвоичныеДанныеФайлаВыгрузки(ИнформационнаяБаза, ДатаСобытия, ТипАрхива) Экспорт
	Результат = Ложь;	
	ДанныеЗаписи = РегистрыСведений.ХранилищеАрхивов.СоздатьМенеджерЗаписи();
	ДанныеЗаписи.ДатаСобытия = ДатаСобытия;
	ДанныеЗаписи.ИнформационнаяБаза = ИнформационнаяБаза.Ссылка;
	ДанныеЗаписи.ТипАрхива = ТипАрхива;
	ДанныеЗаписи.Прочитать();
	Попытка
		Если ДанныеЗаписи.Выбран() Тогда
			ДанныеЗаписи.ДвоичныеДанныеФайлаАрхива = Новый ХранилищеЗначения(Неопределено);
			ДанныеЗаписи.АрхивЗагруженВХранилище = Ложь;
			ДанныеЗаписи.Записать(Истина);
			Результат = Истина;
		КонецЕсли;		
	Исключение
		ЗаписьЖурналаРегистрации("УдалениеДанныхАрхива", УровеньЖурналаРегистрации.Ошибка,,, "Ошибка: " + ОписаниеОшибки());
	КонецПопытки;
	Возврат Результат;
КонецФункции

&НаСервере
//
//
Функция ПолучитьПолныеДанныеЗаписи(ДатаСобытия, ИнформационнаяБаза, ТипАрхива) Экспорт
	ДанныеЗаписи = Неопределено;	
	Отбор = Новый Структура;	
	Отбор.Вставить("ИнформационнаяБаза", ИнформационнаяБаза.Ссылка);	
	Отбор.Вставить("ДатаСобытия", ДатаСобытия);
	Отбор.Вставить("ТипАрхива", ТипАрхива);
	ДанныеЗаписи = РегистрыСведений.ХранилищеАрхивов.Получить(Отбор);
	ДанныеЗаписи.Вставить("ИнформационнаяБаза", ИнформационнаяБаза.Ссылка);
	ДанныеЗаписи.Вставить("ДатаСобытия", ДатаСобытия);
	Возврат ДанныеЗаписи;
КонецФункции

&НаСервере
//
//
Функция СформироватьИмяВременногоФайлаАрхива(ИнформационнаяБаза) Экспорт
	Возврат КаталогВременныхФайлов() + СокрЛП(ИнформационнаяБаза.Ссылка.УникальныйИдентификатор()) + ".dt";
КонецФункции
